var SEP = '!';
var OPTIONAL_SEP = SEP + '?';

var removeUnwantedTerms = function(text) {
  var unwantedTerms = [
    insertOptionalSep('監察院公報……….廉政專刊第') +
      '(\\d{1,3})' + insertOptionalSep('期') + '(\\d{1,3})' + OPTIONAL_SEP
  ];

  unwantedTerms.forEach(function(term) {
    text = text.replace(new RegExp(term, 'g'), SEP);
  });

  return text;
};

var removeSepFromKnownTerms = function(text) {
  var knownTerms = [
    '公職人員財產申報表',
    '申報人姓名',
    '申報日',
    '（二）不動產',
    '1.土地',
    '2.建物（房屋及停車位）',
    '（三）船舶',
    '（四）汽車（含大型重型機器腳踏車）',
    '（五）航空器',
    '（六）現金（指新臺幣、外幣之現金或旅行支票）',
    '（七）存款（指新臺幣、外幣之存款）',
    '（八）有價證券',
    '（九）珠寶、古董、字畫及其他具有相當價值之財產',
    '（十）債權',
    '（十一）債務',
    '（十二）事業投資',
    '（十三）備註',
    '取得價額',
    '本欄空白',
    '地號',
    '建號',
    '買賣',
    '繼承',
    '受贈',
    '贈與',
    '夫妻贈與',
    '拍賣',
    '第一次登記',
    '分割',
    '共有物分割',
    '逕為合併',
    '分割繼承',
    '地籍圖修正測量',
    '持分分割',
    '塗銷信託',
  ];

  knownTerms.forEach(function(term) {
    text = text.replace(
        new RegExp(insertOptionalSep(term), 'g'), wrapStrWithSep(term));
  });

  return text;
};

var fixBadTerms = function(text) {
  // WARNING: The separator is hard-coded in the following table.
  var badTerms = [
    {oldStr: '總!價額', newStr: '總價額'},
    {oldStr: '總金!額', newStr: '總金額'},
    {oldStr: '新臺!幣', newStr: '新臺幣'},
    {oldStr: '新!臺幣', newStr: '新臺幣'},
    {oldStr: '\\(!自建!\\)', newStr: '自建'}
  ];

  badTerms.forEach(function(term) {
    text = text.replace(new RegExp(term.oldStr, 'g'), term.newStr);
  });

  return text;
};

var fixBrokenParts = function(text) {
  // WARNING: The separator is hard-coded in the following table.
  var brokenParts = [
    {oldStr: '新北市淡水區海天段!01761!-!000!51.15!100000!分!劉娟娟!95!年!03!月!買賣!(!超過五年!)!建號!之!303!15!日',
     newStr: '新北市淡水區海天段!01761!-!000!建號!51.15!100000!分!之!303!劉娟娟!95!年!03!月!15!日!買賣!(!超過五年!)'},
    {oldStr: '新北市汐止區金龍段!1265!-!0000!地號!23,654.55!100000!分!之!16!李慶華!102!年!05!買賣!1,100,000!月!01!日',
     newStr: '新北市汐止區金龍段!1265!-!0000!地號!23,654.55!100000!分!之!16!李慶華!102!年!05!月!01日!買賣!1,100,000!'},
    {oldStr: '南投縣集集鎮八張段!0468!-!0002!地號!73.63!3!分之!2!林明溱!94!年!06!月!共有物分割!466,323(!超過!五年!)!22!日',
     newStr: '南投縣集集鎮八張段!0468!-!0002!地號!73.63!3!分之!2!林明溱!94!年!06!月!22!日!共有物分割!466,323(!超過!五年!)'},
    {oldStr: '高雄市杉林區上平段!0529!-!0000!地號!942.75!11!分之!1!林郁方!90!年!06!月!繼承!(!超過五年!)!21!日',
     newStr: '高雄市杉林區上平段!0529!-!0000!地號!942.75!11!分之!1!林郁方!90!年!06!月!21!日!繼承!(!超過五年!)'},
    {oldStr: '本件!3468!建號!為!板橋市海山段!2097!地號!之地上!建物',
     newStr: '本件!3468!建!號!為!板橋市海山段!2097!地!號!之地上!建物'},
    {oldStr: '嘉義!縣朴子市安福段!1144!-!0000!地號!338!全部!廖素惠!97!年!05!月!夫妻贈與!6,084,000!23!日',
     newStr: '嘉義!縣朴子市安福段!1144!-!0000!地號!338!全部!廖素惠!97!年!05!月!23!日!夫妻贈與!6,084,000'},
    {oldStr: '及!6!-!1!地號',
     newStr: '及!6!-!1!地!號'},
    {oldStr: '及!6!-!1!地號',
     newStr: '及!6!-!1!地!號'},
    {oldStr: '及!6!-!1!地號',
     newStr: '及!6!-!1!地!號'},
    {oldStr: '及!6!-!1!地號',
     newStr: '及!6!-!1!地!號'},
    {oldStr: '及!5!-!11!地號',
     newStr: '及!5!-!11!地!號'},
    {oldStr: '嘉義縣朴子市梅華里!299!全部!廖素惠',
     newStr: '嘉義縣朴子市梅華里?????-???建號!299!全部!廖素惠'},
    {oldStr: '苗栗縣竹南鎮中興段!0828!-!0008!地號!26!5!分之!1!陳超明!91!年!11!月!繼承!(!超過五年!)!11!日',
     newStr: '苗栗縣竹南鎮中興段!0828!-!0008!地號!26!5!分之!1!陳超明!91!年!11!月!11!日!繼承!(!超過五年!)'},
    {oldStr: '苗栗縣竹南鎮五福段!0369!-!0000!地號!73.99!180965!分!之!388!3!陳超明!100!年!11!繼承!2,857!月!15!日',
     newStr: '苗栗縣竹南鎮五福段!0369!-!0000!地號!73.99!180965!分!之!388!3!陳超明!100!年!11!月!15!日!繼承!2,857'},
    {oldStr: '苗栗縣竹南鎮照南里!2!鄰光復路!128.30!100000!分!之!33333!陳!超明',
     newStr: '苗栗縣竹南鎮照南里!2!鄰光復路?????-???建號!128.30!100000!分!之!33333!陳!超明'},
    {oldStr: '新北市永和區民治段!0259!-!0000!地號!23!.28!5!分之!1!廖賢哲!76!年!05!月!買賣!(!超過五年!)!29!日',
     newStr: '新北市永和區民治段!0259!-!0000!地號!23!.28!5!分之!1!廖賢哲!76!年!05!月!29!日!買賣!(!超過五年!)'},
    {oldStr: '中和區安邦!段!974.975.976.977.978.979.980.981.1072!地號!合併後為安邦!段!963!地號',
     newStr: '中和區安邦!段!974.975.976.977.978.979.980.981.1072!地!號!合!併後為安邦!段!963!地!號'},
    {oldStr: '新北市樹林區中山路!294.50!全部!洪佳君',
     newStr: '新北市樹林區中山路?????-???建號!294.50!全部!洪佳君'},
    {oldStr: '新北市樹林區中山路!307.80!全部!洪佳君',
     newStr: '新北市樹林區中山路?????-???建號!307.80!全部!洪佳君'},
    {oldStr: '臺中市大雅區大明段!0805!-!0000!地號!196.18!2!分之!1!楊瓊瓔!96!年!03!月!買賣!3,295,824!19!日',
     newStr: '臺中市大雅區大明段!0805!-!0000!地號!196.18!2!分之!1!楊瓊瓔!96!年!03!月!19!日!買賣!3,295,824'},
    {oldStr: '申報人!：廖正井',
     newStr: '申報人：廖正井'},
    {oldStr: '臺中市梧棲區三民段!02032!-!000!建號!175.03!全部!黃玉廷!100!年!06!買賣!2,600,000!月!14!日',
     newStr: '臺中市梧棲區三民段!02032!-!000!建號!175.03!全部!黃玉廷!100!年!06!月!14!日!買賣!2,600,000'},
    {oldStr: '彰化縣溪州鄉育善段!0865!-!0000!地號!267.81!全部!謝新隆!81!年!12!月!買賣!2,146,497(!超!過五年!)!12!日',
     newStr: '彰化縣溪州鄉育善段!0865!-!0000!地號!267.81!全部!謝新隆!81!年!12!月!12!日!買賣!2,146,497(!超!過五年!)'},
    {oldStr: '彰化縣員林鎮大饒段!0573!-!0007!地號!121.14!全部!謝新隆!101!年!04!買賣!2,301,660!月!16!日',
     newStr: '彰化縣員林鎮大饒段!0573!-!0007!地號!121.14!全部!謝新隆!101!年!04!月!16!日!買賣!2,301,660'},
    {oldStr: '彰化縣員林鎮大饒!段!0573!-!0026!地號!72.02!全部!謝新隆!101!年!04!買賣!1,368,380!月!16!日',
     newStr: '彰化縣員林鎮大饒!段!0573!-!0026!地號!72.02!全部!謝新隆!101!年!04!月!16!日!買賣!1,368,380'},
    {oldStr: '彰化縣溪州鄉中央路!3!段!338!號!307.80!3!分之!1!謝新隆',
     newStr: '彰化縣溪州鄉中央路3段338號?????-???建號!307.80!3!分之!1!謝新隆'},
    {oldStr: '彰化縣員林鎮中山路!1!段!67!號!181.30!全部!謝新隆',
     newStr: '彰化縣員林鎮中山路1段67號?????-???建號!181.30!全部!謝新隆'},
    {oldStr: '彰化縣溪州鄉中山路!3!段!270!巷!19!號!105.60!全部!謝新隆',
     newStr: '彰化縣溪州鄉中山路3段270巷19號?????-???建號!105.60!全部!謝新隆'},
    {oldStr: '彰化縣溪州鄉進興路!2!巷!5!號!110.80!全部!謝新隆',
     newStr: '彰化縣溪州鄉進興路2巷5號?????-???建號!110.80!全部!謝新隆'},
    {oldStr: '彰化縣溪州鄉進興路!2!巷!7!號!89.70!全部!謝新隆',
     newStr: '彰化縣溪州鄉進興路2巷7號?????-???建號!89.70!全部!謝新隆'},
    {oldStr: '屏東縣車城鄉福安路!157.86!全部!潘孟安',
     newStr: '屏東縣車城鄉福安路?????-???建號!157.86!全部!潘孟安'},
    {oldStr: '屏東縣恆春鎮德和里德和路!245.10!全部!潘孟安',
     newStr: '屏東縣恆春鎮德和里德和路?????-???建號!245.10!全部!潘孟安'},
    {oldStr: '屏東縣東港鎮新孝段!0232!-!0000!地號!123!全部!蘇清泉!85!年!08!月!買賣!(!超過五年!)!09!日',
     newStr: '屏東縣東港鎮新孝段!0232!-!0000!地號!123!全部!蘇清泉!85!年!08!月!09!日!買賣!(!超過五年!)'},
    {oldStr: '臺!中!市!中!區!平!等!段!六!小!段!0002!-!0041!地號!6.75!4!分之!1!蘇主榮!75!年!06!月!買賣!(!超過五年!)!04!日',
     newStr: '臺!中!市!中!區!平!等!段!六!小!段!0002!-!0041!地號!6.75!4!分之!1!蘇主榮!75!年!06!月!04!日!買賣!(!超過五年!)'},
    {oldStr: '蘇主榮!96!年!03!月!2!6!日!買賣',
     newStr: '蘇主榮!96!年!03!月!26!日!買賣'},
    {oldStr: '屏東縣崁頂鄉頂信段!0344!-!0004!地號!276.50!100!分之!10!蘇○荃!98!年!11!月!贈與!250,000!20!日',
     newStr: '屏東縣崁頂鄉頂信段!0344!-!0004!地號!276.50!100!分之!10!蘇○荃!98!年!11!月!20!日!贈與!250,000'},
    {oldStr: '屏東縣東港鎮新孝段!0318!-!0000!地號!23.77!136380!分!之!38970!蘇○荃!102!年!05!繼承!118,863!月!30!日',
     newStr: '屏東縣東港鎮新孝段!0318!-!0000!地號!23.77!136380!分!之!38970!蘇○荃!102!年!05!月!30!日!繼承!118,863'},
    {oldStr: '臺北市大安區正聲里光復南路!126.70!全部!蘇清泉',
     newStr: '臺北市大安區正聲里光復南路?????-???建號!126.70!全部!蘇清泉'},
    {oldStr: '高雄市新興區開平里七賢一路!166.30!全部!蘇清泉',
     newStr: '高雄市新興區開平里七賢一路?????-???建號!166.30!全部!蘇清泉'},
    {oldStr: '屏東縣東港鎮興東里!26!鄰中正!路!4,758.20!全部!蘇清泉',
     newStr: '屏東縣東港鎮興東里!26!鄰中正!路?????-???建號!4,758.20!全部!蘇清泉'},
    {oldStr: '屏東縣東港鎮興東里中正路!1,160.10!全部!蘇清泉',
     newStr: '屏東縣東港鎮興東里中正路?????-???建號!1,160.10!全部!蘇清泉'},
    {oldStr: '屏東縣東港鎮興東里!34!鄰新學!路!726.80!全部!蘇清泉',
     newStr: '屏東縣東港鎮興東里!34!鄰新學!路?????-???建號!726.80!全部!蘇清泉'},
    {oldStr: '臺中市中區光復里光復路!127.90!全部!蘇主榮',
     newStr: '臺中市中區光復里光復路?????-???建號!127.90!全部!蘇主榮'},
    {oldStr: '臺中市北區金龍里益華街!217.40!全部!蘇主榮',
     newStr: '臺中市北區金龍里益華街?????-???建號!217.40!全部!蘇主榮'},
    {oldStr: '臺中市北區金龍里益華街!133.70!全部!蘇主榮',
     newStr: '臺中市北區金龍里益華街?????-???建號!133.70!全部!蘇主榮'},
    {oldStr: '桃園縣桃園市中德里永福西街!150.90!全部!蘇主榮',
     newStr: '桃園縣桃園市中德里永福西街?????-???建號!150.90!全部!蘇主榮'},
    {oldStr: '屏東縣東港鎮興東里新興二街!1,240.85!100000!分!之!50000!蘇主榮',
     newStr: '屏東縣東港鎮興東里新興二街?????-???建號!1,240.85!100000!分!之!50000!蘇主榮'},
    {oldStr: '與!13!、!14!地號!及!建物總價',
     newStr: '與!13!、!14!地!號!及!建物總價'},
    {oldStr: '與!04!、!14!地號!及!建物總價',
     newStr: '與!04!、!14!地!號!及!建物總價'},
    {oldStr: '與!04!、!13!地號!及!建物總價',
     newStr: '與!04!、!13!地!號!及!建物總價'}
  ];

  brokenParts.forEach(function(part) {
    text = text.replace(part.oldStr, part.newStr);
  });

  var str = '臺北市大安區金華段三小段!0383!-!0004!地號';
  var index = text.indexOf(str);
  console.log(text.substring(index-10, index+500));
  console.log('');

  return text;
};

var fixDates = function(text) {
  var regExpDate = new RegExp(
      OPTIONAL_SEP +
      '(\\d+)' + insertOptionalSep('年') +
      '(\\d+)' + insertOptionalSep('月') +
      '(\\d+)' + insertOptionalSep('日'), 'g');

  return text.replace(regExpDate, wrapStrWithSep('$1年$2月$3日'));
};

var insertOptionalSep = function(str) {
  if (!str) {
    throw 'Invalid string.';
  }

  return OPTIONAL_SEP + str.split('').join(OPTIONAL_SEP) + OPTIONAL_SEP;
};

var wrapStrWithSep = function(str) {
  if (!str) {
    throw 'Invalid string.';
  }

  return SEP + str + SEP;
};

var main = function() {
  var text = '';

  process.stdin.setEncoding('utf8');
  process.stdin.on('readable', function() {
    text += process.stdin.read();
  });
  process.stdin.on('end', function() {
    text = removeUnwantedTerms(text);
    text = removeSepFromKnownTerms(text);
    text = fixBadTerms(text);
    text = fixBrokenParts(text);
    text = fixDates(text);
    process.stdout.write(text);
  });
};

if (require.main === module) {
  main();
}
